:PROPERTIES:
:ID:       222093AC-E4FC-4E90-B124-ADFFC31F6314
:END:
#+title: emacs-lisp

* Help
** Describe Things
*** describe-function

#+begin_src emacs-lisp
  (describe-function #'describe-function)
#+end_src

#+RESULTS:
#+begin_example
describe-function is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h f, <f1> f and <help> f.
It can also be invoked from the menu: Help → Describe → Describe
Function...

(describe-function FUNCTION)

Display the full documentation of FUNCTION (a symbol).
When called from Lisp, FUNCTION may also be a function object.

See the ‘help-enable-symbol-autoload’ variable for special
handling of autoloaded functions.

  Probably introduced at or before Emacs version 22.1.

#+end_example

*** describe-mode

#+begin_src emacs-lisp
  (describe-function #'describe-mode)
#+end_src

#+RESULTS:
#+begin_example
describe-mode is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h m, <f1> m and <help> m.
It can also be invoked from the menu: Help → Describe → Describe
Buffer Modes

(describe-mode &optional BUFFER)

Display documentation of current major mode and minor modes.
A brief summary of the minor modes comes first, followed by the
major mode description.  This is followed by detailed
descriptions of the minor modes, each on a separate page.

For this to work correctly for a minor mode, the mode’s indicator
variable (listed in ‘minor-mode-alist’) must also be a function
whose documentation describes the minor mode.

If called from Lisp with a non-nil BUFFER argument, display
documentation for the major and minor modes of that buffer.

When ‘describe-mode-outline’ is non-nil, Outline minor mode
is enabled in the Help buffer.

  Probably introduced at or before Emacs version 29.1.

#+end_example

*** describe-package

#+begin_src emacs-lisp
  (describe-function #'describe-package)
#+end_src

#+RESULTS:
#+begin_example
describe-package is an autoloaded interactive byte-code-function in
‘package.el’.

It is bound to C-h P, <f1> P and <help> P.
It can also be invoked from the menu: Help → Describe → Describe
Package...

(describe-package PACKAGE)

Display the full documentation of PACKAGE (a symbol).

  Probably introduced at or before Emacs version 24.1.

#+end_example

*** describe-variable

#+begin_src emacs-lisp
  (describe-function #'describe-variable)
#+end_src

#+RESULTS:
#+begin_example
describe-variable is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h v, <f1> v and <help> v.
It can also be invoked from the menu: Help → Describe → Describe
Variable...

(describe-variable VARIABLE &optional BUFFER FRAME)

Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.

  Probably introduced at or before Emacs version 27.1.

#+end_example

** Discover Things
*** shortdoc

#+begin_src emacs-lisp
  (describe-function #'shortdoc)
#+end_src

#+RESULTS:
: shortdoc is an alias for ‘shortdoc-display-group’ in ‘shortdoc.el’.
: 
: (shortdoc GROUP &optional FUNCTION SAME-WINDOW)
: 
: Pop to a buffer with short documentation summary for functions in GROUP.
: Interactively, prompt for GROUP.
: If FUNCTION is non-nil, place point on the entry for FUNCTION (if any).
: If SAME-WINDOW, don’t pop to a new window.
: 

* [[id:58037216-DD41-4C5F-AE7C-7A621EF9D319][lists]]

#+begin_src emacs-lisp
  (shortdoc "list")
#+end_src

#+RESULTS:

* [[id:910846DE-0B6A-4CE4-A32E-3DE30642F744][alists]]

#+begin_src emacs-lisp
  (shortdoc "alist")
#+end_src

#+RESULTS:

** assoc

#+begin_src emacs-lisp
  (describe-function #'assoc)
#+end_src

#+RESULTS:
#+begin_example
assoc is a primitive-function in ‘C source code’.

(assoc KEY ALIST &optional TESTFN)

Return non-nil if KEY is equal to the car of an element of ALIST.
The value is actually the first element of ALIST whose car equals KEY.

Equality is defined by the function TESTFN, defaulting to ‘equal’.
TESTFN is called with 2 arguments: a car of an alist element and KEY.

  Other relevant functions are documented in the list and alist
  groups.
  Probably introduced at or before Emacs version 19.29.
  This function has a byte-code optimizer ‘byte-optimize-assoc’.  See
    the manual for details.

#+end_example

#+end_example

* generic functions

I'm going to use generic functions a lot with emacs-lisp since they
offer an enormously helpful way to reduce the conceptual footprint and
provide richer behaviors.

These tend not to be used heavily...I think potentially due to
performance reasons - but I'll cross that bridge if/when I come to it.
Emacs lisp also tends to understandably gravitate towards specialized
functionality which I'm likely to drag it a bit outside of.

These will typically include a [[id:3A3B17B9-0761-4DB1-A663-B12BC13155B4][context-argument]] to allow for a bit
more future-proofed multimethod support.

** cl-defgeneric
:PROPERTIES:
:ID:       654A5E2B-7B24-48CC-9B26-B15484B4F38C
:END:

#+begin_src emacs-lisp :results value
  (describe-function #'cl-defgeneric)
#+end_src

#+RESULTS:
#+begin_example
cl-defgeneric is a Lisp macro in ‘cl-generic.el’.

(cl-defgeneric NAME ARGS [DOC-STRING] [OPTIONS-AND-METHODS...] &rest
DEFAULT-BODY)

Create a generic function NAME.
DOC-STRING is the base documentation for this class.  A generic
function usually has no body, as its purpose is to decide which
method body is appropriate to use; ARGS are currently ignored if
there’s no body.  If BODY is present, it provides the default
implementation.
Specific implementation methods are defined with ‘cl-defmethod’.
OPTIONS-AND-METHODS currently understands:
- (:documentation DOCSTRING)
- (declare DECLARATIONS)
- (:argument-precedence-order &rest ARGS)
- (:method [QUALIFIERS...] ARGS &rest BODY)
DEFAULT-BODY, if present, is used as the body of a default method.

  Probably introduced at or before Emacs version 25.1.

#+end_example

** cl-defmethod
:PROPERTIES:
:ID:       F2F61FB6-88DE-4275-B318-3B42CA58D65D
:END:

#+begin_src emacs-lisp :results value
  (describe-function #'cl-defmethod)
#+end_src

#+RESULTS:
#+begin_example
cl-defmethod is a Lisp macro in ‘cl-generic.el’.

(cl-defmethod NAME [EXTRA] [QUALIFIER] ARGS &rest [DOCSTRING] BODY)

Define a new method for generic function NAME.
This defines an implementation of NAME to use for invocations
of specific types of arguments.

ARGS is a list of dispatch arguments (see ‘cl-defun’), but where
each variable element is either just a single variable name VAR,
or a list on the form (VAR TYPE).

For instance:

  (cl-defmethod foo (bar (format-string string) &optional zot)
    (format format-string bar))

The dispatch arguments have to be among the mandatory arguments, and
all methods of NAME have to use the same set of arguments for dispatch.
Each dispatch argument and TYPE are specified in ARGS where the corresponding
formal argument appears as (VAR TYPE) rather than just VAR.

The optional EXTRA element, on the form ‘:extra STRING’, allows
you to add more methods for the same specializers and qualifiers.
These are distinguished by STRING.

The optional argument QUALIFIER is a specifier that modifies how
the method is combined with other methods, including:
   :before  - Method will be called before the primary
   :after   - Method will be called after the primary
   :around  - Method will be called around everything else
The absence of QUALIFIER means this is a "primary" method.
The set of acceptable qualifiers and their meaning is defined
(and can be extended) by the methods of ‘cl-generic-combine-methods’.

ARGS can also include so-called context specializers, introduced by
‘&context’ (which should appear right after the mandatory arguments,
before any &optional or &rest).  They have the form (EXPR TYPE) where
EXPR is an Elisp expression whose value should match TYPE for the
method to be applicable.

The set of acceptable TYPEs (also called "specializers") is defined
(and can be extended) by the various methods of ‘cl-generic-generalizers’.

	Currently supported forms for TYPE:

Support for the catch-all t specializer which always matches.

Support for (head VAL) specializers.
These match if the argument is a cons cell whose car is ‘eql’ to VAL.

Support for (eql VAL) specializers.
These match if the argument is ‘eql’ to VAL.

Support for dispatch on types.
This currently works for built-in types and types built on top of records.

Support for (derived-mode MODE) specializers.
Used internally for the (major-mode MODE) context specializers.

Support for dispatch on types defined by ‘oclosure-define’.

Support for dispatch on types defined by EIEIO’s ‘defclass’.

Support for (subclass CLASS) specializers.
These match if the argument is the name of a subclass of CLASS.

  Probably introduced at or before Emacs version 25.1.

#+end_example
